IdeaRS.OpenModel.Material.ProductionType
Production type

IdeaRS.OpenModel.Material.ProductionType.HotRolledAndProcessed
Hot rolled and processed

IdeaRS.OpenModel.Material.ProductionType.Patented
Patented

IdeaRS.OpenModel.Material.ProductionType.ColdDrawn
Cold drawn

IdeaRS.OpenModel.Material.ProductionType.StressRelieved
Stress relieved

IdeaRS.OpenModel.Material.ProductionType.LowRelaxation
Low relaxation